In [4]:
import numpy as np
import pandas as pd

frame = pd.DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'], columns=['Ohio', 'Texas', 'California'])

frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [5]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [8]:
states = ['Texas', 'Utah', 'California']

frame = frame.reindex(columns=states)

frame

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [17]:
frame.loc[['a', 'b', 'c', 'd'], states]

D:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [18]:
frame.reindex(['a', 'b', 'c', 'd'])

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [19]:
frame.drop('Utah', axis=1)

   Texas  California
a      1           2
c      4           5
d      7           8

In [23]:
frame.drop('Utah', axis=1).iat[2,1]

8

In [24]:
format = lambda x: '%.2f' % x

frame.applymap(format)

  Texas Utah California
a  1.00  nan       2.00
c  4.00  nan       5.00
d  7.00  nan       8.00

In [25]:
frame.index.is_unique

True

In [28]:
import numpy.random as npr

array([3, 2, 3, 0, 5, 3, 3, 6, 2, 0, 4, 6, 0, 3, 5, 0, 1, 0, 4, 6, 6])

In [47]:
npr.seed(69)
cub_frame = pd.DataFrame(npr.randint(1, 7, 3*7).reshape((7, 3)), columns=['1 серия', '2 серия', '3 серия'], index=['1', '2', '3', '4', '5', '6', '7'])
cub_frame

   1 серия  2 серия  3 серия
1        4        2        4
2        3        5        2
3        2        1        2
4        1        1        5
5        6        3        5
6        4        6        4
7        1        1        3

In [50]:
res = cub_frame.apply(pd.value_counts)

res

   1 серия  2 серия  3 серия
1      2.0      3.0      NaN
2      1.0      1.0      2.0
3      1.0      1.0      1.0
4      2.0      NaN      2.0
5      NaN      1.0      2.0
6      1.0      1.0      NaN

In [52]:
res.sum(axis=1)

1    5.0
2    4.0
3    3.0
4    4.0
5    3.0
6    2.0
dtype: float64

In [53]:
npr.seed(69)
cub_frame = pd.DataFrame(npr.randint(1, 7, 3*7).reshape((3, 7)), index=['1 серия', '2 серия', '3 серия'], columns=['1', '2', '3', '4', '5', '6', '7'])
cub_frame

         1  2  3  4  5  6  7
1 серия  4  2  4  3  5  2  2
2 серия  1  2  1  1  5  6  3
3 серия  5  4  6  4  1  1  3

In [55]:
res = cub_frame.apply(pd.value_counts, axis=1)

res

           1    2    3    4    5    6
1 серия  NaN  3.0  1.0  2.0  1.0  NaN
2 серия  3.0  1.0  1.0  NaN  1.0  1.0
3 серия  2.0  NaN  1.0  2.0  1.0  1.0

In [56]:
res.sum(axis=0)

1    5.0
2    4.0
3    3.0
4    4.0
5    3.0
6    2.0
dtype: float64